INSERT INTO task (id, name, description, test_cases_count) VALUES
    (nextval('task_id_seq'), 'Сумма чисел', 'Напишите программу, вычисляющую сумму двух чисел.', 3),
    (nextval('task_id_seq'), 'Сортировка пузырьком', 'Реализуйте алгоритм сортировки пузырьком.', 2),
    (nextval('task_id_seq'), 'НОД', 'Напишите функцию для нахождения наибольшего общего делителя.', 2),
    (nextval('task_id_seq'), 'Очередь', 'Реализуйте структуру данных "Очередь" на основе массива.', 2),
    (nextval('task_id_seq'), 'Простое число', 'Напишите программу, определяющую, является ли число простым.', 3),
    (nextval('task_id_seq'), 'Бинарный поиск', 'Разработайте алгоритм бинарного поиска.', 2),
    (nextval('task_id_seq'), 'Стек', 'Реализуйте стек на основе связного списка.', 2),
    (nextval('task_id_seq'), 'Факториал', 'Напишите программу, находящую факториал числа.', 2),
    (nextval('task_id_seq'), 'Быстрая сортировка', 'Реализируйте быструю сортировку.', 2),
    (nextval('task_id_seq'), 'Разность чисел', 'Напишите программу, вычисляющую разность двух чисел.', 3),
    (nextval('task_id_seq'), 'Сортировка слиянием', 'Реализуйте алгоритм сортировки слиянием.', 2);
