INSERT INTO task (id, name, description, test_cases_count) VALUES
    (nextval('task_id_seq'), 'Задание 1', 'Напишите программу, вычисляющую сумму двух чисел.', 3),
    (nextval('task_id_seq'), 'Задание 2', 'Реализуйте алгоритм сортировки пузырьком.', 2),
    (nextval('task_id_seq'), 'Задание 1', 'Напишите функцию для нахождения наибольшего общего делителя.', 2),
    (nextval('task_id_seq'), 'Задание 1', 'Реализуйте структуру данных "Очередь" на основе массива.', 2),
    (nextval('task_id_seq'), 'Задание 2', 'Напишите программу, определяющую, является ли число простым.', 3),
    (nextval('task_id_seq'), 'Задание 1', 'Разработайте алгоритм бинарного поиска.', 2),
    (nextval('task_id_seq'), 'Задание 1', 'Реализуйте стек на основе связного списка.', 2),
    (nextval('task_id_seq'), 'Задание 2', 'Напишите программу, находящую факториал числа.', 2),
    (nextval('task_id_seq'), 'Задание 3', 'Реализируйте быструю сортировку.', 2),
    (nextval('task_id_seq'), 'Задание 1', 'Напишите программу, вычисляющую сумму двух чисел.', 3),
    (nextval('task_id_seq'), 'Задание 2', 'Реализуйте алгоритм сортировки пузырьком.', 2);
