INSERT INTO contest (name, description, start_time, end_time, group_id) VALUES
    ('Контрольная работа по C++: Основы', 'Контрольная работа по базовому синтаксису C++.', '2025-04-01 10:00:00', '2025-04-01 12:00:00', 1),
    ('Контрольная работа по C++: STL', 'Контрольная работа по библиотеке стандартных шаблонов C++.', '2025-04-10 10:00:00', '2025-04-10 12:00:00', 2),
    ('Контрольная работа по C++: ООП', 'Контрольная работа по объектно-ориентированному программированию в C++.', '2025-04-20 10:00:00', '2025-04-20 12:00:00', 3);
