INSERT INTO task (name, description, test_cases_count) VALUES
    ('Задание 1', 'Напишите программу, вычисляющую сумму двух чисел.', 3),
    ('Задание 2', 'Реализуйте алгоритм сортировки пузырьком.', 2),
    ('Задание 1', 'Напишите функцию для нахождения наибольшего общего делителя.', 2),
    ('Задание 1', 'Реализуйте структуру данных "Очередь" на основе массива.', 2),
    ('Задание 2', 'Напишите программу, определяющую, является ли число простым.', 3),
    ('Задание 1', 'Разработайте алгоритм бинарного поиска.', 2),
    ('Задание 1', 'Реализуйте стек на основе связного списка.', 2),
    ('Задание 2', 'Напишите программу, находящую факториал числа.', 2),
    ('Задание 3', 'Реализуйте быструю сортировку.', 2),
    ('Задание 1', 'Напишите программу, вычисляющую сумму двух чисел.', 3),
    ('Задание 2', 'Реализуйте алгоритм сортировки пузырьком.', 2);
